Tekla Open API Reference for Tekla Structures 2025
ShapeItem.IsSolid Property
 Set to true if the shape is detected by TS Core to be a valid solid
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace